package com.bx.gis.common;

/**
 * @Description TODO
 * @Author Breach
 * @Date 2019/2/16
 * @Version V1.0
 **/
public class Common {
    public static final String[] CHICKEN_SOUP = {
            "　　　　　　　　　　　　　　　　　　　　　　　　　　　　　　　　　　　　　　　　　　　　　　　　　　　　　　　　　　　　　　　　　　　　　　　　　　　　　　　　　　　　　　　　　　　   ❀　",
            "生活中我们难免会遇到失意的时候，现实中的计划有时不过是变化中的一部分，但我们不能因此而失去对生活的热情。在我们失意难过的时候，我们更需要一双懂得美好的眼睛，只有这样我们才会懂得珍惜，才会让生活更美好，让快乐永恒。",
            "牵挂一个人，有时是问候，有时是沉默。沉默，不是因为无话可说，而是心中想说的太多太多……曾经以为，只有面对面地交谈才能算是倾听，却没想到，其实体会沉默也是一种倾听。最近才明白，爱情，原本不是要成为生命中一份沉重的负荷。",
            "努力不一定是要让自己耀武扬威牛气哄哄，而是通过努力去实现自己的价值，成功在于你的坚持！只有当你直面生活中的累，坦然接受成长给予的汗水和眼泪，每一次都鼓足勇气迎难而上勇敢地去解决问题，你才能获得真正的成长和力量。不抱有一丝幻想，不放弃一点机会，不停止一日努力。只要不放弃努力，小草也有点缀春天的价值。",
            "在年轻的时候，如果你是爱上了一个人，请一定是要温柔地对待他。不管你们相爱的时间有久，若能始终温柔地相待，那么，所有时刻都将是无瑕的美丽。若是不得不去分离，也是要好好说再见，要在心里是存着感谢，感谢他给你一份记忆。",
            "即便是最老实的人，一生也至少有一次违逆虔诚和感恩美德的经历。每个人都会迈出这一步，和父亲、老师分道扬镳，每个人都应尝一尝孤独的滋味，虽然大多数人承受不住，很快又找到了栖身地",
            "梦想是注定孤独的旅行，路上少不了质疑和嘲笑，但那又怎样，哪怕遍体鳞伤，也要活得漂亮。",
            "I'm just afraid that I have so many so many feelings, you do not care。我只是害怕，害怕我那么多那么多的感情，你都不在乎。",
            "相逢是缘、相知最美、相爱是罪、相守最累！爱到不能爱时说分手，到底是谁辜负了谁？相逢的日子淡如水，谁爱谁都是无所谓的。因为在那个时候的，谁也不会是谁的谁，海阔天空自由飞。",
            "希望是无穷的，别过； 人生是平淡的，别倦； 身体是自己的，别糟； 幸福是有限的，别贪； 美色是他人的，别恋； 爱人是自己的，别厌； 钞票是消费的，别攒； 生活是丰富的，别烦； 人格是高贵的，别贱； 感情是纯洁的，别污； 朋友是永远的，别淡； 权力是暂时的，别钻！",
            "有些事适合分享，有些事却只能深藏。难过了就自己静一静，以沉默，以沉静，此去经年，时间有治愈一切的力量。不要急着告诉所有人你的不幸，不要把伤口晒给所有人看，成长本来就是一个孤立无援的过程，酸甜苦辣要自己尝，漫漫人生要自己过。",
            "人生，就是一种善待；活着，就要学会看淡。别太把别人放的过高，那么你就低了；别太把自己放得过高，那么你就痛了。属于你的走了还会回来，不属于你的回来了还会再走。每个人都有很艰难的时候，熬过去后，你会觉得那些当时快要了你的命的事情，那么多你觉得快要撑不过去的境地，都会慢慢的好起来。",
            "给自己一个又一个可以努力够得到的小目标，没有行与不行，只有做与不做，所谓的大目标自然而然就行了。",
            "一些话，需讲出来，憋在心里，终会伤身；一些情，需要表白，刻意隐藏，终会伤人；心与心之间，在于灵犀；情与情之间，在于温暖；痛的时候，有人疼；伤的时候，有人懂；委屈时，有个怀抱；脆弱时，有个依靠。",
            "曾经的记忆，很多已经淡忘，但有那么几件事，几个人，如暗夜中的星斗，闪烁在心灵的天空，让你平添几多感慨、遗憾或者温暖。有些事微不足道，可它触及了你的精神，任时光冲刷，唯有当初不曾改变；每一个不懂爱旳人，都会遇到一个懂爱的人。然后经历一场撕心裂肺旳爱情，然后分开。",
            "其实，人生有很多东西，都是过期不候。我们，不可能拿着现在的心情，回到最初的选择，昨天太阳，也永远晾不干今天的衣服。人生，很冷酷，又很温暖；人性，很复杂，又很简单而唯美。心不动，风奈何；心不惜，情得已；心不伤，岁月无恙。原来，一切可去，可留，更可无……",
            "生活是一杯白开水，慢品无味，喝快了却容易呛着；生活是一颗洋葱头，不剥会枯萎，剥多了却流泪；生活是一道道梁，不翻会困死山中，翻过才发现还有无数道。生活，生下来，活下去。所以：活就活出美丽、活出意义、活出价值、活出你的了不起。",
            "每个人都需要不断的新的革命，并非惊天动地，而是那回归初心的简单、正直、与坚持。",
            "It's never too late to be the person you want to be.成为自己想成为的人，永远不会太迟。",
            "相爱，说简单点就是学习信任一个人。能够坚持异地恋的人那都是深切的爱着的，这样的爱在时间的河流里平淡却激烈，我想这是所有人都会羡慕的爱。拥有着这样的爱的你，难道不幸福吗？",
            "你对每个人都真心，对每件事都努力，无论何时你总是选择相信相信，然后有一天，你发现其实在对方心里你没那么重要，有的事努力了也没结果，一直相信的东西早就悄悄变了模样。",
            "我是怎样的人，我自己懂就好了；我过怎样的日子，我自己享受或者承担就好了。苦日子苦过，好日子享受，没必要令所有人都懂得和了解。",
            "没有道路直接通向成功，我们必须用自己的辛勤与汗水，来凝结这条漫长的道路！",
            "总有一段路，要自己走，总有一些人，要慢慢忘。对待感情，心要真，对待小人，心要狠。真心实意的，维系；虚情假意的，抛弃。失去了真心，此生难寻；揭穿了虚情，不要伤心！",
            "通过爱一个人，投入一段必须互相付出的关系，进一步了解人，了解自己，在优化生命这个意义下，爱情才算伟大。",
            "小时候，总觉得外表光鲜华丽就是美，住上豪华的房子，吃上山珍海味就是幸福；生活在都市，品尽灯红酒绿就会快乐。现在生活在繁华都市了，也风光无限，在这复杂的人生里，历尽淘浪，洗尽铅华，才发现，返璞归真才是心灵之需，简单寂静才是灵魂之愿呀",
            "人生不如意事十有八九，每一次失败，对我都是无情的打击，等待我的是质疑和嘲笑。可我并不在乎，不会为了一些小人而愤愤不平。虽说道路上充满了坎坷，但那又如何，就算遍体鳞伤，我依然能痛快的歌唱。",
            "一生就这么一次，谈一场以结婚为目的的恋爱吧。不再因为任性而不肯低头，不再因为固执而轻言分手。最后地坚信一次，一直走，就可以到白头。就那样相守，在来往的流年里，岁月安好。惟愿这一生，执子之手，与子偕老。",
            "If there was the man in the world, others will become will! And I do not want to will.如果世界上曾经有那个人出现过，其他人都会变成将就！而我不愿意将就。",
            "缘分，聚散如云；人心，冷暖难觅；感情，动心伤情。其实没有什么过不去，过不去的只是自己的心。 回忆再美也只是曾经，再也回不去；结束了就是结束了，该继续的还得继续。人不能因为感情而失去自己，更不能为了失去而没了感情。有些风景再美丽，不属于自己的不必太刻意，有些剧情再入胜，自己不是主角不必太入戏。缘分的失去是别离，也是选择的再继续；感情的失去是放弃，也是放下的一种智慧。",
            "人活得累，是因为能左右你心情的东西太多。天气的变化，人情的冷暖，不同的风景都会影响你的心情。而他们都是你无法左右的。看淡了，天无非阴晴，人不过聚散，沧海桑田，我心不惊，自然安稳。活在当下，并安于自已的选择，为自已的每一个选择负完全的责任，便是晴天。",
            "知道没有结果，却不愿意面对现实。有些事看得太清，反而伤神；有些人读的太懂，竟然伤心。只要脚还站在地上，就别把自己看得太轻；只要你还活在世上，就别把自己看得太重。很多东西，任你多么努力终归还是失去；很多感情，任你如何珍惜却重复着相同的别离。",
            "人生在世，需要向前看，更需要常回头看看。过去的莞尔一笑，该放下的放下，该铭记的铭记；未来的坦然面对，让来的来，让去的去。",
            "凡做事，“只要你想，什么时候都为时不晚。” 不要因为犹豫或惰性，加上旁人弄舌插足，或是老天的节外生枝，最后一事无成，只剩下长吁短叹了！ 惰性会销蚀人的精力和志气。想做就去做！ 人生只有一次，让现在的每一天都以自己喜爱的方式度过！",
            "生命中最重要的人，或许当你在身边的时候，能感觉到的也只是淡淡的温暖而已，并不比一杯热茶更显著。但当你失去的时候，整个世界瞬间荒芜。只知道我们总是在战胜空间，却对时间无能为力。",
            "人生是一场马拉松，不可能所有的选手都站在同一条起跑线上。我们虽选择不了出身，但是可以选择前进的方式，即使前路泥泞不堪，也请风雨兼程。相比于那些顺风顺水的人，我们无非是走得累些。当登上顶峰之后，我们确信，能看到世间最美的风景！",
            "人生不只是坐着等待，有的人本来幸福着，却看起来很烦恼；有的人本该烦恼，却看起来很幸福。每个人都有他的路，每条路都是正确的。人的不幸在于他们不想走自己那条路，总想走别人的路。",
            "生活中不可能天天都有明媚的阳光，总会有乌云和阴雨。我们无法预测未知的前程，但我们可以保持乐观、平和的心态，面对顺境时不妄自尊大，保持谦虚和进取；遇到挫折时不妄自菲薄，能够忍耐和坚持。只要拥有一颗足够强大的内心，任何困难都会迎刃而解。",
            "如果你不相信努力和时光，那么成果就会是第一个选择辜负你的。不要去否定你自己的过去，也不要用你的过去牵扯你现在的努力和对未来的展望。不是因为拥有希望你才去努力，而是去努力了，你才有可能看到希望的光芒。",
            "平淡了，执着地蕴积，总有精彩；路尽了，适时地拐弯，天地自宽。别在乎一时的拥有，莫沉陷短暂的离愁，草长花会开，极目方望远，一切都有规律，无须刻意就好。你可以哭泣，可以心疼，但不能绝望。今天的泪水，会是你明天的成长；今天的伤痕，会是你明天的坚强。",
            "习惯的力量是巨大的，它无时无刻不在影响着我们的思维方式和行为模式。我们每天大部分的行为都是出自习惯的支配，可以说，几乎在每一天，我们所做的每一件事，都是习惯使然。无论你觉得自己多么的了不起，也永远有人比你更强。打击与挫败是成功的踏脚石，而不是绊脚石。",
            "永远不要辜负自己的心，因为它能给你全部的爱。好心情才会有好风景，好眼光才会有好发现，好思考才会有好主意。人可以不美丽，但要健康；人可以不伟大，但要快乐；人可以不完美，但要追求。把工作当享受，你就会竭尽全力；把生活当乐趣，你就会满怀信心。",
            "定要明白，自己所做的一切都是为了追寻一种状态，一种自我的满足感和幸福感。不要害怕什么，这世上可供害怕的事太多了，你是害怕不完的。世俗是大多数人要走的路，责任是你必须要履行的义务。如果说我们每一个人都可以把自己分内的责任做好，那我们这个社会自然就和谐了。",
            "用单纯的眼光看待人生，你将少掉许多莫名的烦恼；用幸福的脚印丈量生活，你的步履会轻盈洒脱；用感恩的心去面对帮你的人，你会发现人间真的有许多无私与美好；用宽容的心去面对伤你的人，你会觉得他们其实也都不容易。人生，总有许多沟坎要跨越，岁月，总有许多遗憾要弥补，生命，总有许多迷茫要领悟。",
            "于仰望中我们感到了卑微，于比较中我们感到了差距。人生就是这样，我们常常仰望，每每比较，仰望身边的众人，比较四周的他人。仰望间，看到的总是别人的幸福，他人的美好。要努力使每一天都开心而有意义，没有人可以回到过去从头再来，但是每个人都可以从今天开始，创造一个全新的结局。",
            "比我差的人还没放弃，比我好的人仍在努力，我就更没资格说，我无能为力。",
            "人的一生，难免都会有遗憾。总想如愿以偿，却有那么多的大失所望；总想全心投入，而得到的却是有所保留。羡慕的不能拥有，牵挂的不能相守，想放弃却不甘放手，想忘记却习惯回首。其实没有遗憾的人生，就不叫人生。",
            "人生就是这样，一半糊涂，一半清醒，有时糊涂，有时清醒。什么时候，放下随意，放弃如意，或许也是一种快乐，一种幸福。失落时悄悄徘徊，伤感时默默遐想。",
            "谁没流过泪，谁没受过伤，风雨波折是成长，眼泪擦干后依然坚强。因为活着不仅是一种经历，一种感悟，更是懂得的一种意义。总有些伤痛，可以安慰别人却安慰不了自己；总有些纠结，不是跟事过不去，而是跟心过不去。",
            "也许，我们相遇本来就是一场错误，也许，我爱你只是一时兴起，也许，你只是逢场作戏而已，不然我们的感情就不会脆弱到，连小小的风雨也抵不过…… ",
            "越厉害的人越拼，因为他周围都是这样的人，深知实现精神自由的前提是财务自由和迁徙自由；越不上进的人越懒，因为当一个井底之蛙，大家你看看我，我看看你，都觉得差不多，也就无所谓了，慢慢过日子吧。"
    };
}
